0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Uinlet          (5 0 0);

#include        "include/initialConditions";

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions";
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    top
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions";
    }

    buildings
    {
        type            noSlip;
    }

    ground
    {
        type            noSlip;
    }

    terrain
    {
        type            noSlip;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
