0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//epsilonInlet  0.0064; // Cmu^0.75 * k^1.5 / L ; L =10

#include        "include/initialConditions";

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $turbulentEpsilon;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    #include        "include/ABLConditions";

    buildings
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.42;
        E               9.8;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditions"
    }

    top
    {
        type            atmBoundaryLayerInletEpsilon;
        #include        "include/ABLConditions"
    }

    ground
    {
	type            epsilonz0WallFunction;
        z0              $z0;
        value           uniform $turbulentEpsilon;
    }

    terrain
    {
        type            epsilonz0WallFunction;
        z0              $z0;
        value           uniform $turbulentEpsilon;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
