0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//kInlet          0.1499;   // approx k = 1.5*(I*U)^2 ; I = 0.1

#include        "include/initialConditions";

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    inlet
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    top
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    buildings
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }

    ground
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }

    terrain
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
