0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
         type           totalPressure;
         p0             $internalField;
        value           $internalField;
    }

    top
    {
        type            zeroGradient;
    }

    buildings
    {
        type            zeroGradient;
    }

    ground
    {
        type            zeroGradient;
    }

    terrain
    {
        type            zeroGradient;
    }

    #include "include/sideAndTopPatches"
}

// ************************************************************************* //
