system/dakotaParameter.orig
alpha = {alpha}
beta = {beta}
distance_dunes = {distance_dunes}
