system/line3.txt
1.500000000000000000e+01 -3.000000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.985000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.969999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.955000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.939999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.925000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.910000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.894999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.880000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.864999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.850000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.835000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.819999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.805000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.789999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.775000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.760000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.744999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.730000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.714999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.700000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.685000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.669999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.655000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.639999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.625000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.610000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.594999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.580000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.564999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.550000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.535000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.519999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.505000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.489999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.475000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.460000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.444999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.430000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.414999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.400000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.385000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.369999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.355000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.339999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.325000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.310000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.294999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.280000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.264999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.250000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.235000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.219999999999999929e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.205000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.189999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.175000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.160000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.145000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.130000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.114999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.100000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.085000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.070000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.055000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.039999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.025000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -2.010000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.995000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.980000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.964999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.950000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.935000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.920000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.905000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.889999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.875000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.860000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.845000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.830000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.814999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.800000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.785000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.770000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.755000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.739999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.725000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.710000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.695000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.680000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.664999999999999858e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.650000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.635000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.620000000000000284e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.605000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.590000000000000036e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.575000000000000000e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.560000000000000142e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.545000000000000107e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.530000000000000071e+01 2.799999999999999822e+00
1.500000000000000000e+01 -1.515000000000000036e+01 2.799999999999999822e+00
...
1.500000000000000000e+01 3.000000000000000000e+02 2.799999999999999822e+00
