system/probes1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U epsilon nut k);
probeLocations
(
    (-1   -1 0.3)
    (-1  1.5 0.3)
    (-1    4 0.3)
    (-1    5 0.3)
    (-1  7.5 0.3)
    (-1   10 0.3)
    (-1   11 0.3)
    (-1 13.5 0.3)
    (-1   16 0.3)
    (-1   17 0.3)
    (-1 19.5 0.3)
    (-1   22 0.3)
    (-1   23 0.3)
    (-1 25.5 0.3)
    (-1   28 0.3)
    ( 2   -1 0.3)
    ( 2    4 0.3)
    ( 2    5 0.3)
    ( 2   10 0.3)
    ( 2   11 0.3)
    ( 2   16 0.3)
    ( 2   17 0.3)
    ( 2   22 0.3)
    ( 2   23 0.3)
    ( 2   28 0.3)
    ( 5   -1 0.3)
    ( 5    4 0.3)
    ( 5    5 0.3)
    ( 5   10 0.3)
    ( 5   11 0.3)
    ( 5   16 0.3)
    ( 5   17 0.3)
    ( 5   22 0.3)
    ( 5   23 0.3)
    ( 5   28 0.3)
    ( 8   -1 0.3)
    ( 8  1.5 0.3)
    ( 8    4 0.3)
    ( 8    5 0.3)
    ( 8  7.5 0.3)
    ( 8   10 0.3)
    ( 8   11 0.3)
    ( 8 13.5 0.3)
    ( 8   16 0.3)
    ( 8   17 0.3)
    ( 8 19.5 0.3)
    ( 8   22 0.3)
    ( 8   23 0.3)
    ( 8 25.5 0.3)
    ( 8   28 0.3)
);

// ************************************************************************* //
