system/probes2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields (p U k epsilon);
probeLocations
(
    (-3.0 -3.0 0.0)
  (-3.0 -3.0 1.33)
  (-3.0 -3.0 2.67)
  (-3.0 -3.0 4.0)
  (-1.14 -3.0 0.0)
  (-1.14 -3.0 1.33)
  (-1.14 -3.0 2.67)
  (-1.14 -3.0 4.0)
  (0.71 -3.0 0.0)
  (0.71 -3.0 1.33)
  (0.71 -3.0 2.67)
  (0.71 -3.0 4.0)
  (2.57 -3.0 0.0)
  (2.57 -3.0 1.33)
  (2.57 -3.0 2.67)
  (2.57 -3.0 4.0)
  (4.43 -3.0 0.0)
  (4.43 -3.0 1.33)
  (4.43 -3.0 2.67)
  (4.43 -3.0 4.0)
  (6.29 -3.0 0.0)
  (6.29 -3.0 1.33)
  (6.29 -3.0 2.67)
  (6.29 -3.0 4.0)
  (8.14 -3.0 0.0)
  (8.14 -3.0 1.33)
  (8.14 -3.0 2.67)
  (8.14 -3.0 4.0)
  (10.0 -3.0 0.0)
  (10.0 -3.0 1.33)
  (10.0 -3.0 2.67)
  (10.0 -3.0 4.0)
  (-3.0 -1.78 0.0)
  (-3.0 -1.78 1.33)
  (-3.0 -1.78 2.67)
  (-3.0 -1.78 4.0)
  (-1.14 -1.78 0.0)
  (-1.14 -1.78 1.33)
  (-1.14 -1.78 2.67)
  (-1.14 -1.78 4.0)
  (0.71 -1.78 0.0)
  (0.71 -1.78 1.33)
  (0.71 -1.78 2.67)
  (0.71 -1.78 4.0)
  (2.57 -1.78 0.0)
  (2.57 -1.78 1.33)
  (2.57 -1.78 2.67)
  (2.57 -1.78 4.0)
  (4.43 -1.78 0.0)
  (4.43 -1.78 1.33)
  (4.43 -1.78 2.67)
  (4.43 -1.78 4.0)
  (6.29 -1.78 0.0)
  (6.29 -1.78 1.33)
  (6.29 -1.78 2.67)
  (6.29 -1.78 4.0)
  (8.14 -1.78 0.0)
  (8.14 -1.78 1.33)
  (8.14 -1.78 2.67)
  (8.14 -1.78 4.0)
  (10.0 -1.78 0.0)
  (10.0 -1.78 1.33)
  (10.0 -1.78 2.67)
  (10.0 -1.78 4.0)
  (-3.0 -0.56 0.0)
  (-3.0 -0.56 1.33)
  (-3.0 -0.56 2.67)
  (-3.0 -0.56 4.0)
  (-1.14 -0.56 0.0)
  (-1.14 -0.56 1.33)
  (-1.14 -0.56 2.67)
  (-1.14 -0.56 4.0)
  (0.71 -0.56 0.0)
  (0.71 -0.56 1.33)
  (0.71 -0.56 2.67)
  (0.71 -0.56 4.0)
  (2.57 -0.56 0.0)
  (2.57 -0.56 1.33)
  (2.57 -0.56 2.67)
  (2.57 -0.56 4.0)
  (4.43 -0.56 0.0)
  (4.43 -0.56 1.33)
  (4.43 -0.56 2.67)
  (4.43 -0.56 4.0)
  (6.29 -0.56 0.0)
  (6.29 -0.56 1.33)
  (6.29 -0.56 2.67)
  (6.29 -0.56 4.0)
  (8.14 -0.56 0.0)
  (8.14 -0.56 1.33)
  (8.14 -0.56 2.67)
  (8.14 -0.56 4.0)
  (10.0 -0.56 0.0)
  (10.0 -0.56 1.33)
  (10.0 -0.56 2.67)
  (10.0 -0.56 4.0)
  (-3.0 0.67 0.0)
  (-3.0 0.67 1.33)
  (-3.0 0.67 2.67)
...
);

// ************************************************************************* //
