system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    buildings
    {
        type triSurfaceMesh;
        file "bldg_Model_00_run_00.obj";
    }

    terrain
    {
        type triSurfaceMesh;
        file "terrain_Model_00_run_00.obj";
    }

    refinementBox
    {
        type searchableBox;
        min  ( -3  -3   0);
        max  ( 16  36   6);
    }

    plane
    {
	    type            searchablePlate;
	    origin          (6.5 16.5 0);
	    span            (9.5 19.5 0);
    }
};

castellatedMeshControls
{
    features
    (
      { file  "bldg_Model_00_run_00.eMesh"; level 1; }
      { file  "terrain_Model_00_run_00.eMesh"; level 1; }
    );

    refinementSurfaces
    {
        buildings
        {
            level (4 4);
            patchInfo { type wall; }
        }

        terrain
        {
            level (4 4);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 4));
        }
    }

    locationInMesh (-0.5 -0.5 1);
}

snapControls
{
    explicitFeatureSnap    true;
    implicitFeatureSnap    false;
}

addLayersControls
{
    layers
    {
        buildings
        {
            nSurfaceLayers 4;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.1;
    minThickness        1e-3;
}

meshQualityControls
{}

writeFlags
(
    // scalarLevels
    // layerSets
    // layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
