system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields       (p U);

surfaces
(
    xNormal
    {
        $cuttingPlane;
    }

    yNormal
    {
        $cuttingPlane;
        pointAndNormalDict
        {
            normalVector $y;      // Overrides default normalVector (1 0 0)
        }                         // $y: macro for (0 1 0)
    }

    zNormal
    {
        $cuttingPlane;
        pointAndNormalDict
        {
            basePoint    (0 0 2); // Overrides default basePoint (0 0 0)
            normalVector $z;      // $z: macro for (0 0 1)
        }
    }

    p100
    {
        $isosurface;
        isoField    p;
        isoValue    100;
    }

    CAD
    {
        $patchSurface;
        patches     (CAD);
    }
);

// ************************************************************************* //
